## INTRO TO PANDAS AND NUMPY FOR DATA ANALYSIS

In [1]:
# import the needed libraries

import pandas as pd
import numpy as np

In [3]:
# check the version of the libraries
print(np.__version__)
print(pd.__version__)

1.26.2
2.1.4

### creating dataframe from scratch

In [5]:
# creating dataframe from scratch using list of lists

# create the data list
students_list = [
    ['tola',23,'f','single'],
    ['femi',15,'m', 'married'],
    ['sodiq',35,'f','divorced'],
    ['wale',10,'m','single']
]

# create a list of columns names
column_name = ['name','age','gender','marital_status']

# turn the data list to a dataframe
student_df = pd.DataFrame(data= students_list, columns = column_name)
student_df

    name  age gender marital_status
0   tola   23      f         single
1   femi   15      m        married
2  sodiq   35      f       divorced
3   wale   10      m         single

In [6]:
# creating dataframe from dictionaries

# create a dictionary

club_dict = {
    'club_name': ['utd','chelsea','city','arsenal','spurs'],
    'ucl': [3,2,1,0,0],
    'best_player': ['bruno','palmer','Bernado','Saliba','Son']
}

club_df = pd.DataFrame(data=club_dict)
club_df

  club_name  ucl best_player
0       utd    3       bruno
1   chelsea    2      palmer
2      city    1     Bernado
3   arsenal    0      Saliba
4     spurs    0         Son

In [ ]:
# exercise:
# create a dataframe of countries, capital and continent.

### import existing csv files

In [7]:
insurance_df = pd.read_csv('insurance.csv')

#### Pandas Methods and attributes for data wrangling

In [11]:
# .head method
insurance_df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [12]:
# .tail method
insurance_df.tail(3)

      age     sex    bmi  children smoker     region     charges
1335   18  female  36.85         0     no  southeast   1629.8335
1336   21  female  25.80         0     no  southwest   2007.9450
1337   61  female  29.07         0    yes  northwest  29141.3603

In [26]:
# .shape attribute
insurance_df.shape

(1338, 7)

In [27]:
# .info method

insurance_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       1338 non-null   int64
 1   sex       1338 non-null   object
 2   bmi       1338 non-null   float64
 3   children  1338 non-null   int64
 4   smoker    1338 non-null   object
 5   region    1338 non-null   object
 6   charges   1338 non-null   float64
dtypes: float64(2), int64(2), object(3)
memory usage: 73.3+ KB

In [ ]:
# .isnull() with sum() methods for checking null values (frequency)

insurance_df.isnull().sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

In [ ]:
# checking for missing values using isnull.() and .any()
insurance_df.isnull().any()

age         False
sex         False
bmi         False
children    False
smoker      False
region      False
charges     False
dtype: bool

In [ ]:
# creating new colums with static values

insurance_df['dumb_column'] = 4
insurance_df.head(4)

   age     sex     bmi  children smoker     region      charges  dumb_column
0   19  female  27.900         0    yes  southwest  16884.92400            4
1   18    male  33.770         1     no  southeast   1725.55230            4
2   28    male  33.000         3     no  southeast   4449.46200            4
3   33    male  22.705         0     no  northwest  21984.47061            4

In [35]:
# creating new columns with basic arithmetic

insurance_df['tax'] = insurance_df['charges'] * 0.03
insurance_df.head(3)

,age,sex,bmi,children,smoker,region,charges,dumb_column,tax
0,19,female,27.90,0,yes,southwest,16884.9240,4,506.547720
1,18,male,33.77,1,no,southeast,1725.5523,4,51.766569
2,28,male,33.00,3,no,southeast,4449.4620,4,133.483860

In [ ]:
# create a new column based on conditions
insurance_df['age_group'] = ['teenager' if x < 20
                             else 'adult' if x < 60
                             else 'old' for x in insurance_df['age']]
insurance_df.head(3)

,age,sex,bmi,children,smoker,region,charges,dumb_column,tax,age_group
0,19,female,27.90,0,yes,southwest,16884.9240,4,506.547720,teenager
1,18,male,33.77,1,no,southeast,1725.5523,4,51.766569,teenager
2,28,male,33.00,3,no,southeast,4449.4620,4,133.483860,adult

In [ ]:
# create a column based on multiple condition using .apply()

def young_smoker(data):
    if data['age'] < 20 and data['smoker'] == 'yes':
        return 'yes'
    else:
        return 'No'
    
insurance_df['young_smoker'] = insurance_df.apply(young_smoker, axis = 1)

In [43]:
insurance_df.head()

,age,sex,bmi,children,smoker,region,charges,dumb_column,tax,age_group,young_smoker
0,19,female,27.900,0,yes,southwest,16884.92400,4,506.547720,teenager,yes
1,18,male,33.770,1,no,southeast,1725.55230,4,51.766569,teenager,No
2,28,male,33.000,3,no,southeast,4449.46200,4,133.483860,adult,No
3,33,male,22.705,0,no,northwest,21984.47061,4,659.534118,adult,No
4,32,male,28.880,0,no,northwest,3866.85520,4,116.005656,adult,No

In [47]:
# droping rows or columns using .drop method

insurance_df.drop(['tax','dumb_column'], axis = 1, inplace = True)

In [50]:
# drop rows 

insurance_df.drop(list(range(0,101)), inplace = True)

In [55]:
# reset_index method 

insurance_df.reset_index(drop = True, inplace = True)
insurance_df.head(3)

,age,sex,bmi,children,smoker,region,charges,age_group,young_smoker
0,30,male,25.460,0,no,northeast,3645.0894,adult,No
1,18,female,30.115,0,no,northeast,21344.8467,teenager,No
2,61,female,29.920,3,yes,southeast,30942.1918,old,No

In [56]:
# how to slice a dataframe

insurance_df[['age','bmi','region']]

      age     bmi     region
0      30  25.460  northeast
1      18  30.115  northeast
2      61  29.920  southeast
3      34  27.500  southwest
4      20  28.025  northwest
...   ...     ...        ...
1232   50  30.970  northwest
1233   18  31.920  northeast
1234   18  36.850  southeast
1235   21  25.800  southwest
1236   61  29.070  northwest

[1237 rows x 3 columns]

In [60]:
# groupby method for pivoting

insurance_df[['smoker','bmi']].groupby(by='smoker').count()

        bmi
smoker
no      990
yes     247

In [61]:
# row filtering based on conditions

insurance_df[insurance_df['sex'] == 'male']

,age,sex,bmi,children,smoker,region,charges,age_group,young_smoker
0,30,male,25.460,0,no,northeast,3645.08940,adult,No
4,20,male,28.025,1,yes,northwest,17560.37975,adult,No
6,26,male,30.875,2,no,northwest,3877.30425,adult,No
7,29,male,27.940,0,no,southeast,2867.11960,adult,No
8,63,male,35.090,0,yes,southeast,47055.53210,old,No
...,...,...,...,...,...,...,...,...,...
1223,31,male,25.935,1,no,northwest,4239.89265,adult,No
1224,61,male,33.535,0,no,northeast,13143.33665,old,No
1226,51,male,30.030,1,no,southeast,9377.90470,adult,No
1228,52,male,38.600,2,no,southwest,10325.20600,adult,No
1232,50,male,30.970,3,no,northwest,10600.54830,adult,No

In [66]:
# row filtering based on multiple conditions

insurance_df[(insurance_df['sex'] == 'male') & 
             (insurance_df['region'] == 'northeast') &
             (insurance_df['smoker'] == 'yes')]

,age,sex,bmi,children,smoker,region,charges,age_group,young_smoker
22,44,male,31.350,1,yes,northeast,39556.49450,adult,No
56,18,male,25.175,0,yes,northeast,15518.18025,teenager,yes
84,36,male,41.895,3,yes,northeast,43753.33705,adult,No
106,35,male,27.740,2,yes,northeast,20984.09360,adult,No
149,18,male,17.290,2,yes,northeast,12829.45510,teenager,yes
153,50,male,31.825,0,yes,northeast,41097.16175,adult,No
161,52,male,24.320,3,yes,northeast,24869.83680,adult,No
180,54,male,40.565,3,yes,northeast,48549.17835,adult,No
237,50,male,32.300,1,yes,northeast,41919.09700,adult,No
280,55,male,30.685,0,yes,northeast,42303.69215,adult,No
321,40,male,32.775,1,yes,northeast,39125.33225,adult,No
375,24,male,28.500,0,yes,northeast,35147.52848,adult,No
522,18,male,33.535,0,yes,northeast,34617.84065,teenager,yes
537,39,male,26.410,0,yes,northeast,20149.32290,adult,No
567,62,male,32.015,0,yes,northeast,45710.20785,old,No
637,23,male,31.730,3,yes,northeast,36189.10170,adult,No
641,53,male,34.105,0,yes,northeast,43254.41795,adult,No
698,33,male,24.795,0,yes,northeast,17904.52705,adult,No
726,36,male,28.025,1,yes,northeast,20773.62775,adult,No
727,41,male,30.780,3,yes,northeast,39597.40720,adult,No
785,57,male,28.975,0,yes,northeast,27218.43725,adult,No
810,18,male,31.730,0,yes,northeast,33732.68670,teenager,yes
816,45,male,22.895,0,yes,northeast,35069.37452,adult,No
846,37,male,34.200,1,yes,northeast,39047.28500,adult,No
857,43,male,34.960,1,yes,northeast,41034.22140,adult,No
874,29,male,22.895,0,yes,northeast,16138.76205,adult,No
932,18,male,21.565,0,yes,northeast,13747.87235,teenager,yes
941,20,male,30.685,0,yes,northeast,33475.81715,adult,No
1069,18,male,27.360,1,yes,northeast,17178.68240,teenager,yes
1148,32,male,33.630,1,yes,northeast,37607.52770,adult,No
1149,24,male,29.830,0,yes,northeast,18648.42170,adult,No
1166,24,male,31.065,0,yes,northeast,34254.05335,adult,No
1177,39,male,29.925,1,yes,northeast,22462.04375,adult,No
1203,42,male,24.605,2,yes,northeast,21259.37795,adult,No
1220,62,male,26.695,0,yes,northeast,28101.33305,old,No

In [67]:
# .describe method

insurance_df.describe()

               age          bmi     children       charges
count  1237.000000  1237.000000  1237.000000   1237.000000
mean     39.235247    30.647753     1.097817  13169.641634
std      13.990361     6.131709     1.203139  11997.231260
min      18.000000    15.960000     0.000000   1121.873900
25%      27.000000    26.220000     0.000000   4753.636800
50%      40.000000    30.305000     1.000000   9361.326800
75%      51.000000    34.500000     2.000000  16450.894700
max      64.000000    53.130000     5.000000  63770.428010

In [75]:
# .value_counts method

insurance_df['smoker'].value_counts(ascending = True)

smoker
yes    247
no     990
Name: count, dtype: int64

In [79]:
temp_df = insurance_df['smoker'].value_counts(ascending = True)
temp_df = pd.DataFrame(temp_df)

In [85]:
temp_df['percentage'] = [f'{round(x/temp_df['count'].sum() * 100, 3)}%'
                         for x in temp_df['count']]
temp_df

        count percentage
smoker
yes       247    19.968%
no        990    80.032%

In [86]:
# .unique method to check the number of unique values

insurance_df['region'].unique()

array(['northeast', 'southeast', 'southwest', 'northwest'], dtype=object)

In [ ]:
# .nunique for counting number of unique elements
insurance_df['region'].nunique()

4

##### Assignment

- Apply all the methods covered in class on any dataset of your choice
- Go to pandas documentation and implement any 5 new method on your
dataset
- Write a short medium article on those new methods you just found out.